org-mode/Org-mode进行文学编程的最佳配置.org
#+TITLE: Org-mode进行文学编程的最佳配置
#+URL: http://fgiasson.com/blog/index.php/2016/06/21/optimal-emacs-settings-for-org-mode-for-literate-programming/?utm_content=36384675&utm_medium=social&utm_source=twitter
#+AUTHOR: lujun9972
#+CATEGORY: org-mode
#+DATE: [2016-08-12 周五 16:47]
#+OPTIONS: ^:{}


我一度热衷于用Emacs和Org-mode以文学编程的方式开发来开发Clojure. 我也写过了很多关于文学编程的文章,比如[[http://fgiasson.com/blog/index.php/2016/04/27/my-literal-programming-commitment/][它的基础理念]], [[http://fgiasson.com/blog/index.php/2016/05/30/creating-and-running-unit-tests-directly-in-source-files-with-org-mode/][文学编程的好处]], [[http://fgiasson.com/blog/index.php/2016/06/09/literate-programming-and-team-development/][等]][[http://fgiasson.com/blog/index.php/2016/04/05/using-clojure-in-org-mode-and-implementing-asynchronous-processing/][等]]. 
这一次我想告诉你们我是怎么来实践文学编程的,我在实践过程中总结出来的经验有哪些,我写程序时一般是怎样的结构,等等内容.

不过在我开始之前,我想我有必要先解释一下为了用文学编程开发应用时有一个流畅的体验,我是怎样配置Org-mode的.
再然后才会写一系列的文章来解释我是怎么组织Clojure项目的,我的开发流程等内容.

如果你没有配置过Clojure/Cider, 那我推荐你[[http://fgiasson.com/blog/index.php/2016/06/14/my-optimal-gnu-emacs-settings-for-developing-clojure-revised/][看看这篇文章]], 它会告诉你如何在Emacs中配置Clojure开发环境.

* Packages

[[http://fgiasson.com/blog/index.php/2016/06/14/my-optimal-gnu-emacs-settings-for-developing-clojure-revised/][Emacs安装Cider之后]], 你要做的第一件事就是安装下面这些package. 这些package,有些是使用Org-mode必须的,有些能够优化Org-mode的使用体验.

1. [[http://orgmode.org/][org]]
2. [[https://github.com/emacsmirror/adaptive-wrap][adaptive-wrap]]
3. [[https://www.emacswiki.org/emacs/Htmlize][htmlize]]

安装过程也很容易,运行下面这些命令就行:

#+BEGIN_EXAMPLE
M-x package-install [RET] org [RET]
M-x package-install [RET] adaptive-wrap [RET]
M-x package-install [RET] htmlize [RET]
#+END_EXAMPLE

你也可以先运行 =M-x package-list-packages=, 然后将光标移动到要安装的package那一行. 按下 =i= (意思是install), 等待所有要安装的package都选中后,再按下 =x= (意思是execute) 就可以一次性安装所有的package了.

* Configure Org-mode Editor Behaviors

Org-mode安装之后有很多默认的设置,但是我觉得它的默认设置不适于进行文学编程. 
首先我要隐藏掉一些Org-mode的标志,而代之以显示为它真正要显示的字体样式. 例如,我不想看到 =/test/= 这样的内容,而应该看到的是斜体的 =test=. 同样的,粗体,链接也是一样的显示方式. 为了做到这一点,我们需要设置一下 =org-hide-emphasis-markers= 变量.

然后我会为Org-mode设置开启Emacs visual line mode. 这样就会自动折行而无需手工调整.

#+BEGIN_SRC emacs-lisp
  (require 'org)

  ;; Remove the markup characters, i.e., "/text/" becomes (italized) "text"
  (setq org-hide-emphasis-markers t)

  ;; Turn on visual-line-mode for Org-mode only
  ;; Also install "adaptive-wrap" from elpa
  (add-hook 'org-mode-hook 'turn-on-visual-line-mode)
#+END_SRC

* Configure Cider for Org-mode

由于我们想用文学编程的方式来开发Clojure,因此我们需要配置一下Org-mode让它使用Cider作为Clojure的后端. 
Org-mode的code block功能支持许多的编程语言. 然而除了像Elisp(Elisp本身使用Emacs作为后端)这样的语言外,绝大部分的语言都要有一个后端作支持.
我们要做的就是为Clojure设置一个后端.

这里我们首先要做的是告诉Org-mode要支持哪些语言的code blocks. 我这里暂时只定义了4种语言: clojure, sh, dot 和 elisp.

然后我们要设置 =org-babel-clojure-backend= 为cider.

#+BEGIN_SRC emacs-lisp
  ;; Configure org-mode with Cider

  ;; Configure Org-mode supported languages
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((clojure . t)
     (sh . t)
     (dot . t)
     (emacs-lisp . t)))

  ;; Use cider as the Clojure execution backend
  (setq org-babel-clojure-backend 'cider)
  (require 'cider)
#+END_SRC

** Useful Key Bindings

Cider本身有一些快捷键如果能直接在Org-mode触发那就很方便了. 要做到这样也不难,只要像下面这样设置就行了. 
我这里设置了两个快捷键,一个用来运行上一个Clojure表达式的,快捷键为 =C-x C-e=. 还有一个是获取symbol的文档说明的,快捷键是 =C-c C-d=

你可能会觉得奇怪为什么要重新设置一下快捷键呢? 这是因为Org-mode的code block本身不是处于Clojure major mode下的, 因此Clojure major mode的快捷键并不能在Org文件中直接使用. 这也就是为什么我们需要在org-mode下重用映射一次快捷键的原因了.

#+BEGIN_SRC emacs-lisp
  ;; Useful keybindings when using Clojure from Org
  (org-defkey org-mode-map "\C-x\C-e" 'cider-eval-last-sexp)
  (org-defkey org-mode-map "\C-c\C-d" 'cider-doc)
#+END_SRC

** Configuration of Custom Features

在我的[[http://fgiasson.com/blog/index.php/2016/04/05/using-clojure-in-org-mode-and-implementing-asynchronous-processing/][Using Clojure in Org-mode and Implementing Asynchronous Processing]] 一文中,我提到了 =org-babel-clojure= 实现的一些限制,也展示了越过这些限制的方法.
这里与那篇文章中设置唯一不同的地方在于我需要去除nrepl中间层的超时设置. 方法如下:

#+BEGIN_SRC emacs-lisp
  ;; No timeout when executing calls on Cider via nrepl
  (setq org-babel-clojure-sync-nrepl-timeout nil)
#+END_SRC

请确保你只有在已经按照上面那篇博文中所提到的方法修改了 =org-bable-clojure= 的情况下才做上面的设置.

