blog/2016/08/12/org-mode进行文学编程的最佳配置/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>Org-mode进行文学编程的最佳配置 - EMACS-DOCUMENT</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"/>
  <meta name="author" content="lujun9972" />
  <!-- <link rel="stylesheet" href="../../../../../media/css/main.css" type="text/css"/>
       <link rel="stylesheet" href="../../../../../media/css/comment.css" type="text/css"/> -->
  <link rel='stylesheet' href='https://cdn.jsdelivr.net/gh/kognise/water.css@latest/dist/dark.css'>
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">
</head>

  <body><div class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="../../../../../">EMACS-DOCUMENT</a></h1>
    <p>=============&gt;集思广益</p>
    <nav class="site-nav">
      <ul class="trigger">
        <li><a href="../../../../../years/">Years</a></li>
        <li><a href="../../../../../authors/">Authors</a></li>
        <li><a href="../../../../../tags/">Tags</a></li>
        <li><a href="../../../../../about/">About</a></li>
        <li><a href="https://github.com/lujun9972/emacs-document">Github</a></li>
        <li><a href="../../../../../rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="https://www.bing.com/search">
      <input type="text" class="field" name="q" id="s" placeholder="Search">
      <input type="hidden" name="as_sitesearch" value="lujun9972.github.io/emacs-document">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">Org-mode进行文学编程的最佳配置</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org20cc5c2">1. Packages</a></li>
<li><a href="#orga4c1374">2. Configure Org-mode Editor Behaviors</a></li>
<li><a href="#orgf10f6c9">3. Configure Cider for Org-mode</a>
<ul>
<li><a href="#orge2c6df4">3.1. Useful Key Bindings</a></li>
<li><a href="#org17e31e5">3.2. Configuration of Custom Features</a></li>
</ul>
</li>
<li><a href="#org769e0ba">4. Configure Code blocks Behaviors</a></li>
<li><a href="#org01b0b0d">5. Change Behaviors On Save</a></li>
<li><a href="#org529e206">6. Export Configurations</a>
<ul>
<li><a href="#org8001121">6.1. Enable External Exporters</a></li>
</ul>
</li>
<li><a href="#org8dd100b">7. Dired Configuration</a></li>
<li><a href="#org0179fff">8. Spell checker</a></li>
<li><a href="#orgfb8028a">9. DOT support</a></li>
<li><a href="#org1d2c6ac">10. Inline Images Display</a></li>
<li><a href="#org9efec3d">11. Language Specific Libraries</a></li>
<li><a href="#org50e91c7">12. Helpful Keys for Working With Org-mode</a></li>
<li><a href="#orgaa3bda8">13. Conclusion</a></li>
</ul>
</div>
</div>
<p>
我一度热衷于用Emacs和Org-mode以文学编程的方式开发来开发Clojure. 我也写过了很多关于文学编程的文章,比如<a href="http://fgiasson.com/blog/index.php/2016/04/27/my-literal-programming-commitment/">它的基础理念</a>, <a href="http://fgiasson.com/blog/index.php/2016/05/30/creating-and-running-unit-tests-directly-in-source-files-with-org-mode/">文学编程的好处</a>, <a href="http://fgiasson.com/blog/index.php/2016/06/09/literate-programming-and-team-development/">等</a><a href="http://fgiasson.com/blog/index.php/2016/04/05/using-clojure-in-org-mode-and-implementing-asynchronous-processing/">等</a>. 
这一次我想告诉你们我是怎么来实践文学编程的,我在实践过程中总结出来的经验有哪些,我写程序时一般是怎样的结构,等等内容.
</p>

<p>
不过在我开始之前,我想我有必要先解释一下为了用文学编程开发应用时有一个流畅的体验,我是怎样配置Org-mode的.
再然后才会写一系列的文章来解释我是怎么组织Clojure项目的,我的开发流程等内容.
</p>

<p>
如果你没有配置过Clojure/Cider, 那我推荐你<a href="http://fgiasson.com/blog/index.php/2016/06/14/my-optimal-gnu-emacs-settings-for-developing-clojure-revised/">看看这篇文章</a>, 它会告诉你如何在Emacs中配置Clojure开发环境.
</p>

<div id="outline-container-org20cc5c2" class="outline-2">
<h2 id="org20cc5c2"><span class="section-number-2">1</span> Packages</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://fgiasson.com/blog/index.php/2016/06/14/my-optimal-gnu-emacs-settings-for-developing-clojure-revised/">Emacs安装Cider之后</a>, 你要做的第一件事就是安装下面这些package. 这些package,有些是使用Org-mode必须的,有些能够优化Org-mode的使用体验.
</p>

<ol class="org-ol">
<li><a href="http://orgmode.org/">org</a></li>
<li><a href="https://github.com/emacsmirror/adaptive-wrap">adaptive-wrap</a></li>
<li><a href="https://www.emacswiki.org/emacs/Htmlize">htmlize</a></li>
</ol>

<p>
安装过程也很容易,运行下面这些命令就行:
</p>

<pre class="example">
M-x package-install [RET] org [RET]
M-x package-install [RET] adaptive-wrap [RET]
M-x package-install [RET] htmlize [RET]
</pre>

<p>
你也可以先运行 <code>M-x package-list-packages</code>, 然后将光标移动到要安装的package那一行. 按下 <code>i</code> (意思是install), 等待所有要安装的package都选中后,再按下 <code>x</code> (意思是execute) 就可以一次性安装所有的package了.
</p>
</div>
</div>

<div id="outline-container-orga4c1374" class="outline-2">
<h2 id="orga4c1374"><span class="section-number-2">2</span> Configure Org-mode Editor Behaviors</h2>
<div class="outline-text-2" id="text-2">
<p>
Org-mode安装之后有很多默认的设置,但是我觉得它的默认设置不适于进行文学编程. 
首先我要隐藏掉一些Org-mode的标志,而代之以显示为它真正要显示的字体样式. 例如,我不想看到 <code>/test/</code> 这样的内容,而应该看到的是斜体的 <code>test</code>. 同样的,粗体,链接也是一样的显示方式. 为了做到这一点,我们需要设置一下 <code>org-hide-emphasis-markers</code> 变量.
</p>

<p>
然后我会为Org-mode设置开启Emacs visual line mode. 这样就会自动折行而无需手工调整.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">require</span> '<span style="color: #a45bad;">org</span><span style="color: #4f97d7;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Remove the markup characters, i.e., "/text/" becomes (italized) "text"</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> org-hide-emphasis-markers t<span style="color: #4f97d7;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Turn on visual-line-mode for Org-mode only</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Also install "adaptive-wrap" from elpa</span>
<span style="color: #4f97d7;">(</span>add-hook 'org-mode-hook 'turn-on-visual-line-mode<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf10f6c9" class="outline-2">
<h2 id="orgf10f6c9"><span class="section-number-2">3</span> Configure Cider for Org-mode</h2>
<div class="outline-text-2" id="text-3">
<p>
由于我们想用文学编程的方式来开发Clojure,因此我们需要配置一下Org-mode让它使用Cider作为Clojure的后端. 
Org-mode的code block功能支持许多的编程语言. 然而除了像Elisp(Elisp本身使用Emacs作为后端)这样的语言外,绝大部分的语言都要有一个后端作支持.
我们要做的就是为Clojure设置一个后端.
</p>

<p>
这里我们首先要做的是告诉Org-mode要支持哪些语言的code blocks. 我这里暂时只定义了4种语言: clojure, sh, dot 和 elisp.
</p>

<p>
然后我们要设置 <code>org-babel-clojure-backend</code> 为cider.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Configure org-mode with Cider</span>

<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Configure Org-mode supported languages</span>
<span style="color: #4f97d7;">(</span>org-babel-do-load-languages
 'org-babel-load-languages
 '<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>clojure . t<span style="color: #2d9574;">)</span>
   <span style="color: #2d9574;">(</span>sh . t<span style="color: #2d9574;">)</span>
   <span style="color: #2d9574;">(</span>dot . t<span style="color: #2d9574;">)</span>
   <span style="color: #2d9574;">(</span>emacs-lisp . t<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Use cider as the Clojure execution backend</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> org-babel-clojure-backend 'cider<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">require</span> '<span style="color: #a45bad;">cider</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>

<div id="outline-container-orge2c6df4" class="outline-3">
<h3 id="orge2c6df4"><span class="section-number-3">3.1</span> Useful Key Bindings</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Cider本身有一些快捷键如果能直接在Org-mode触发那就很方便了. 要做到这样也不难,只要像下面这样设置就行了. 
我这里设置了两个快捷键,一个用来运行上一个Clojure表达式的,快捷键为 <code>C-x C-e</code>. 还有一个是获取symbol的文档说明的,快捷键是 <code>C-c C-d</code>
</p>

<p>
你可能会觉得奇怪为什么要重新设置一下快捷键呢? 这是因为Org-mode的code block本身不是处于Clojure major mode下的, 因此Clojure major mode的快捷键并不能在Org文件中直接使用. 这也就是为什么我们需要在org-mode下重用映射一次快捷键的原因了.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Useful keybindings when using Clojure from Org</span>
<span style="color: #4f97d7;">(</span>org-defkey org-mode-map <span style="color: #2d9574;">"\C-x\C-e"</span> 'cider-eval-last-sexp<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>org-defkey org-mode-map <span style="color: #2d9574;">"\C-c\C-d"</span> 'cider-doc<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org17e31e5" class="outline-3">
<h3 id="org17e31e5"><span class="section-number-3">3.2</span> Configuration of Custom Features</h3>
<div class="outline-text-3" id="text-3-2">
<p>
在我的<a href="http://fgiasson.com/blog/index.php/2016/04/05/using-clojure-in-org-mode-and-implementing-asynchronous-processing/">Using Clojure in Org-mode and Implementing Asynchronous Processing</a> 一文中,我提到了 <code>org-babel-clojure</code> 实现的一些限制,也展示了越过这些限制的方法.
这里与那篇文章中设置唯一不同的地方在于我需要去除nrepl中间层的超时设置. 方法如下:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">No timeout when executing calls on Cider via nrepl</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> org-babel-clojure-sync-nrepl-timeout nil<span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
请确保你只有在已经按照上面那篇博文中所提到的方法修改了 <code>org-bable-clojure</code> 的情况下才做上面的设置.
</p>
</div>
</div>
</div>
