org-mode/Org-mode进行文学编程的最佳配置.org
* Configure Code blocks Behaviors

Org-mode中的code block有它们独特的行为规范,例如,缩进的空格数量,是否能使用shift+方向键选中文本,是否使用编程语言所属mode的原生tab行为以及语法高亮等等. 对于这些行为规范,我们也能做出改变.

#+BEGIN_SRC emacs-lisp
  ;; Let's have pretty source code blocks
  (setq org-edit-src-content-indentation 0
        org-src-tab-acts-natively t
        org-src-fontify-natively t
        org-confirm-babel-evaluate nil
        org-support-shift-select 'always)
#+END_SRC

* Change Behaviors On Save

将Org-mode配置成文学编程环境最主要的是配置org-mode文档保存时的行为.

使用文学编程的目的是在记录软件开发过程,软件的作用,软件的实现等内容的同时将软件编写出来. 我希望每次保存文件时,都能自动抽取出文件中的代码并保存到相应的Clojure源文件中去. 要做到这一点,需要为 =after-save-hook= 添加一个新的函数, 这个新的函数先判断当前保存的buffer是否是Org-mode的buffer,若是的话,则调用Org-mode的tangle过程.

此外,在实际用文学编程开发Clojure时,你通常还有在另一个buffer中打开tangled的源文件. 这时若你修改了org文件并保存,则buffer中的内容与tangled文件的实际内容就不同步了. 要解决这个问题需要开启 =global-auto-revert-mode=. 它会在buffer所属文件被修改后,自动重新加载文件的内容.

最后,Org-mode可不仅仅是用来写那些code blocks. 我常常会在我的Org文件中设置待办任务,这样就能知道还有哪些事情待完成. 
然而你可能用Org-mode同时开发多个项目,也可能因为Org-mode的其他功能而在别处创建了Org文件,在这种情况下,通过搜索整个计算机来追踪你有哪些待办事项是不现实的. 
因此Org-mode提供了agenda功能,能够创建一个所有的待办事项列表. 你只需要运行 =M-x org-todo-list= 就能看到所有Org文件中的所有待办事项的列表了. 但前提是你需要手工将Org文件推送到它agenda系统中.
agenda本身没有什么问题,问题是是我们很容易忘记把相关的Org文件推送到agenda中. 因此,我选择每次保存Org文件时都自动推送该Org文件到Org agenda中. 这样就不怕遗漏了什么待办事项没有完成了.

#+BEGIN_SRC emacs-lisp
  ;; Tangle Org files when we save them
  (defun tangle-on-save-org-mode-file()
    (when (string= (message "%s" major-mode) "org-mode")
      (org-babel-tangle)))

  (add-hook 'after-save-hook 'tangle-on-save-org-mode-file)

  ;; Enable the auto-revert mode globally. This is quite useful when you have 
  ;; multiple buffers opened that Org-mode can update after tangling.
  ;; All the buffers will be updated with what changed on the disk.
  (global-auto-revert-mode)  

  ;; Add Org files to the agenda when we save them
  (defun to-agenda-on-save-org-mode-file()
    (when (string= (message "%s" major-mode) "org-mode")
      (org-agenda-file-to-front)))

  (add-hook 'after-save-hook 'to-agenda-on-save-org-mode-file)
#+END_SRC

* Export Configurations

你也可以设置导出og文件的方式. 我就将 =org-html-htmlize-output-type= 设置成了 =css= (默认是inline-css) 这样导出的HTML文件中就不会包含CSS了. 我比较喜欢用我使用的HTML theme的CSS来渲染导出的HTML.
但是有些时候我也确实需要用到inline CSS (比如我想为我的博客导出HTML时)时,因此我也定义了一个简单的elisp代码块,在其中将 =org-html-htmlize-output-type= 的值设置回 =inline-css=, 这样就能恢复导出的默认方式了.

#+BEGIN_SRC emacs-lisp
  ;; make sure that when we export in HTML, that we don't export with inline css.
  ;; that way the CSS of the HTML theme will be used instead which is better
  (setq org-html-htmlize-output-type 'css)
#+END_SRC

** Enable External Exporters

存在有大量的Org-mode的导出插件,然而大部分默认情况下都不会启用. 为了使用那些第三方的插件你需要从[[http://orgmode.org/w/org-mode.git?p=org-mode.git;a=tree;f=contrib/lisp;h=c5dc72cebae54e5175f373d5b85f1a6bdbbd764f;hb=refs/heads/master][这个Git仓库]] 中的 =contrib/lisp= 目录中抽取出来放到 =[home]/.emacs.d/elpa/[org-20160623]/= 下.

下面这段代码能够启用导出为Confulence的插件,随后你可以通过 =M-x org-confulence-export-as-confluence= 将org文件导出成Confulence格式.

#+BEGIN_SRC emacs-lisp
  ;; Enable Confluence export
  (require 'ox-confluence)
#+END_SRC

* Dired Configuration

我个人经常使用Dired. 然而它默认会显示所有的文件,包括那些自动产生的auto-save文件. 我倾向于把这些文件在Dired buffer中过滤掉.

#+BEGIN_SRC emacs-lisp
  ; Remove autosave and other unnecessary files to see in Dire
  (require 'dired-x)
  (setq-default dired-omit-files-p t) ; Buffer-local variable
  (setq dired-omit-files "^\\.?#")
#+END_SRC

* Spell checker

若能在Org-mode中开启拼写检查,那想是极好的. 目前我搭配着 ~ispell~ 以及 ~flyspell~ 来做到拼写检查. 目前来说它们工作的挺好的,但是美中不足的是,aspell的windows版本以及有14年没有更新了! 好希望有人能解决一下这个问题啊.

要开启拼写检查,第一步是去下载一个[[http://aspell.net/win32/][GNU Aspell (我用的是Windows版)]]. 然后我们要告诉Emacs aspell的目录地址. 再然后是为text-mode及其子mode开启Flyspell功能. 最后要记得确保已经下载了合适的语言包.

#+BEGIN_SRC emacs-lisp
  (custom-set-variables
   '(ispell-program-name "c:\\Program Files (x86)\\Aspell\\bin\\aspell.exe"))

  ;; Enable Flyspell for text modes
  (add-hook 'text-mode-hook 'flyspell-mode)
#+END_SRC

