blog/2016/08/12/org-mode进行文学编程的最佳配置/index.html

<div id="outline-container-org769e0ba" class="outline-2">
<h2 id="org769e0ba"><span class="section-number-2">4</span> Configure Code blocks Behaviors</h2>
<div class="outline-text-2" id="text-4">
<p>
Org-mode中的code block有它们独特的行为规范,例如,缩进的空格数量,是否能使用shift+方向键选中文本,是否使用编程语言所属mode的原生tab行为以及语法高亮等等. 对于这些行为规范,我们也能做出改变.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Let's have pretty source code blocks</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> org-edit-src-content-indentation <span style="color: #a45bad;">0</span>
      org-src-tab-acts-natively t
      org-src-fontify-natively t
      org-confirm-babel-evaluate nil
      org-support-shift-select 'always<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org01b0b0d" class="outline-2">
<h2 id="org01b0b0d"><span class="section-number-2">5</span> Change Behaviors On Save</h2>
<div class="outline-text-2" id="text-5">
<p>
将Org-mode配置成文学编程环境最主要的是配置org-mode文档保存时的行为.
</p>

<p>
使用文学编程的目的是在记录软件开发过程,软件的作用,软件的实现等内容的同时将软件编写出来. 我希望每次保存文件时,都能自动抽取出文件中的代码并保存到相应的Clojure源文件中去. 要做到这一点,需要为 <code>after-save-hook</code> 添加一个新的函数, 这个新的函数先判断当前保存的buffer是否是Org-mode的buffer,若是的话,则调用Org-mode的tangle过程.
</p>

<p>
此外,在实际用文学编程开发Clojure时,你通常还有在另一个buffer中打开tangled的源文件. 这时若你修改了org文件并保存,则buffer中的内容与tangled文件的实际内容就不同步了. 要解决这个问题需要开启 <code>global-auto-revert-mode</code>. 它会在buffer所属文件被修改后,自动重新加载文件的内容.
</p>

<p>
最后,Org-mode可不仅仅是用来写那些code blocks. 我常常会在我的Org文件中设置待办任务,这样就能知道还有哪些事情待完成. 
然而你可能用Org-mode同时开发多个项目,也可能因为Org-mode的其他功能而在别处创建了Org文件,在这种情况下,通过搜索整个计算机来追踪你有哪些待办事项是不现实的. 
因此Org-mode提供了agenda功能,能够创建一个所有的待办事项列表. 你只需要运行 <code>M-x org-todo-list</code> 就能看到所有Org文件中的所有待办事项的列表了. 但前提是你需要手工将Org文件推送到它agenda系统中.
agenda本身没有什么问题,问题是是我们很容易忘记把相关的Org文件推送到agenda中. 因此,我选择每次保存Org文件时都自动推送该Org文件到Org agenda中. 这样就不怕遗漏了什么待办事项没有完成了.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Tangle Org files when we save them</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">tangle-on-save-org-mode-file</span><span style="color: #bc6ec5;">()</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">when</span> <span style="color: #2d9574;">(</span>string= <span style="color: #67b11d;">(</span>message <span style="color: #2d9574;">"%s"</span> major-mode<span style="color: #67b11d;">)</span> <span style="color: #2d9574;">"org-mode"</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span>org-babel-tangle<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span>add-hook 'after-save-hook 'tangle-on-save-org-mode-file<span style="color: #4f97d7;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Enable the auto-revert mode globally. This is quite useful when you have </span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">multiple buffers opened that Org-mode can update after tangling.</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">All the buffers will be updated with what changed on the disk.</span>
<span style="color: #4f97d7;">(</span>global-auto-revert-mode<span style="color: #4f97d7;">)</span>  

<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Add Org files to the agenda when we save them</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defun</span> <span style="color: #bc6ec5; font-weight: bold;">to-agenda-on-save-org-mode-file</span><span style="color: #bc6ec5;">()</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">when</span> <span style="color: #2d9574;">(</span>string= <span style="color: #67b11d;">(</span>message <span style="color: #2d9574;">"%s"</span> major-mode<span style="color: #67b11d;">)</span> <span style="color: #2d9574;">"org-mode"</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span>org-agenda-file-to-front<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span>add-hook 'after-save-hook 'to-agenda-on-save-org-mode-file<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org529e206" class="outline-2">
<h2 id="org529e206"><span class="section-number-2">6</span> Export Configurations</h2>
<div class="outline-text-2" id="text-6">
<p>
你也可以设置导出og文件的方式. 我就将 <code>org-html-htmlize-output-type</code> 设置成了 <code>css</code> (默认是inline-css) 这样导出的HTML文件中就不会包含CSS了. 我比较喜欢用我使用的HTML theme的CSS来渲染导出的HTML.
但是有些时候我也确实需要用到inline CSS (比如我想为我的博客导出HTML时)时,因此我也定义了一个简单的elisp代码块,在其中将 <code>org-html-htmlize-output-type</code> 的值设置回 <code>inline-css</code>, 这样就能恢复导出的默认方式了.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">make sure that when we export in HTML, that we don't export with inline css.</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">that way the CSS of the HTML theme will be used instead which is better</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> org-html-htmlize-output-type 'css<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org8001121" class="outline-3">
<h3 id="org8001121"><span class="section-number-3">6.1</span> Enable External Exporters</h3>
<div class="outline-text-3" id="text-6-1">
<p>
存在有大量的Org-mode的导出插件,然而大部分默认情况下都不会启用. 为了使用那些第三方的插件你需要从<a href="http://orgmode.org/w/org-mode.git?p=org-mode.git;a=tree;f=contrib/lisp;h=c5dc72cebae54e5175f373d5b85f1a6bdbbd764f;hb=refs/heads/master">这个Git仓库</a> 中的 <code>contrib/lisp</code> 目录中抽取出来放到 <code>[home]/.emacs.d/elpa/[org-20160623]/</code> 下.
</p>

<p>
下面这段代码能够启用导出为Confulence的插件,随后你可以通过 <code>M-x org-confulence-export-as-confluence</code> 将org文件导出成Confulence格式.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Enable Confluence export</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">require</span> '<span style="color: #a45bad;">ox-confluence</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8dd100b" class="outline-2">
<h2 id="org8dd100b"><span class="section-number-2">7</span> Dired Configuration</h2>
<div class="outline-text-2" id="text-7">
<p>
我个人经常使用Dired. 然而它默认会显示所有的文件,包括那些自动产生的auto-save文件. 我倾向于把这些文件在Dired buffer中过滤掉.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa1ae; background-color: #292e34;">; </span><span style="color: #2aa1ae; background-color: #292e34;">Remove autosave and other unnecessary files to see in Dire</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">require</span> '<span style="color: #a45bad;">dired-x</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">setq-default</span> dired-omit-files-p t<span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">; </span><span style="color: #2aa1ae; background-color: #292e34;">Buffer-local variable</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> dired-omit-files <span style="color: #2d9574;">"^\\.?#"</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0179fff" class="outline-2">
<h2 id="org0179fff"><span class="section-number-2">8</span> Spell checker</h2>
<div class="outline-text-2" id="text-8">
<p>
若能在Org-mode中开启拼写检查,那想是极好的. 目前我搭配着 <code>ispell</code> 以及 <code>flyspell</code> 来做到拼写检查. 目前来说它们工作的挺好的,但是美中不足的是,aspell的windows版本以及有14年没有更新了! 好希望有人能解决一下这个问题啊.
</p>

<p>
要开启拼写检查,第一步是去下载一个<a href="http://aspell.net/win32/">GNU Aspell (我用的是Windows版)</a>. 然后我们要告诉Emacs aspell的目录地址. 再然后是为text-mode及其子mode开启Flyspell功能. 最后要记得确保已经下载了合适的语言包.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>custom-set-variables
 '<span style="color: #bc6ec5;">(</span>ispell-program-name <span style="color: #2d9574;">"c:\\Program Files (x86)\\Aspell\\bin\\aspell.exe"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Enable Flyspell for text modes</span>
<span style="color: #4f97d7;">(</span>add-hook 'text-mode-hook 'flyspell-mode<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
